/* $OpenBSD: smult_curve25519_ref.c,v 1.2 2013/11/02 22:02:14 markus Exp $ */
/*
version 20081011
Matthew Dempsky
Public domain.
Derived from public domain code by D. J. Bernstein.
*/

صحيح crypto_scalarmult_curve25519(بینښه حرف *, ثابت بینښه حرف *, ثابت بینښه حرف *);

ساكن فراغ جمع_کړه(بینښه صحيح بهر[32],ثابت بینښه صحيح a[32],ثابت بینښه صحيح b[32])
{
  بینښه صحيح j;
  بینښه صحيح u;
  u = 0;
  لكل (j = 0;j < 31;++j) { u += a[j] + b[j]; بهر[j] = u & 255; u >>= 8; }
  u += a[31] + b[31]; بهر[31] = u;
}

ساكن فراغ sub(بینښه صحيح بهر[32],ثابت بینښه صحيح a[32],ثابت بینښه صحيح b[32])
{
  بینښه صحيح j;
  بینښه صحيح u;
  u = 218;
  لكل (j = 0;j < 31;++j) {
    u += a[j] + 65280 - b[j];
    بهر[j] = u & 255;
    u >>= 8;
  }
  u += a[31] - b[31];
  بهر[31] = u;
}

ساكن فراغ squeeze(بینښه صحيح a[32])
{
  بینښه صحيح j;
  بینښه صحيح u;
  u = 0;
  لكل (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u & 127;
  u = 19 * (u >> 7);
  لكل (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u;
}

ساكن ثابت بینښه صحيح minusp[32] = {
 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128
} ;

ساكن فراغ freeze(بینښه صحيح a[32])
{
  بینښه صحيح aorig[32];
  بینښه صحيح j;
  بینښه صحيح negative;

  لكل (j = 0;j < 32;++j) aorig[j] = a[j];
  جمع_کړه(a,a,minusp);
  negative = -((a[31] >> 7) & 1);
  لكل (j = 0;j < 32;++j) a[j] ^= negative & (aorig[j] ^ a[j]);
}

ساكن فراغ mult(بینښه صحيح بهر[32],ثابت بینښه صحيح a[32],ثابت بینښه صحيح b[32])
{
  بینښه صحيح i;
  بینښه صحيح j;
  بینښه صحيح u;

  لكل (i = 0;i < 32;++i) {
    u = 0;
    لكل (j = 0;j <= i;++j) u += a[j] * b[i - j];
    لكل (j = i + 1;j < 32;++j) u += 38 * a[j] * b[i + 32 - j];
    بهر[i] = u;
  }
  squeeze(بهر);
}

ساكن فراغ mult121665(بینښه صحيح بهر[32],ثابت بینښه صحيح a[32])
{
  بینښه صحيح j;
  بینښه صحيح u;

  u = 0;
  لكل (j = 0;j < 31;++j) { u += 121665 * a[j]; بهر[j] = u & 255; u >>= 8; }
  u += 121665 * a[31]; بهر[31] = u & 127;
  u = 19 * (u >> 7);
  لكل (j = 0;j < 31;++j) { u += بهر[j]; بهر[j] = u & 255; u >>= 8; }
  u += بهر[j]; بهر[j] = u;
}

ساكن فراغ مربع(بینښه صحيح بهر[32],ثابت بینښه صحيح a[32])
{
  بینښه صحيح i;
  بینښه صحيح j;
  بینښه صحيح u;

  لكل (i = 0;i < 32;++i) {
    u = 0;
    لكل (j = 0;j < i - j;++j) u += a[j] * a[i - j];
    لكل (j = i + 1;j < i + 32 - j;++j) u += 38 * a[j] * a[i + 32 - j];
    u *= 2;
    إذا ((i & 1) == 0) {
      u += a[i / 2] * a[i / 2];
      u += 38 * a[i / 2 + 16] * a[i / 2 + 16];
    }
    بهر[i] = u;
  }
  squeeze(بهر);
}

ساكن فراغ select(بینښه صحيح p[64],بینښه صحيح q[64],ثابت بینښه صحيح r[64],ثابت بینښه صحيح s[64],بینښه صحيح b)
{
  بینښه صحيح j;
  بینښه صحيح t;
  بینښه صحيح bminus1;

  bminus1 = b - 1;
  لكل (j = 0;j < 64;++j) {
    t = bminus1 & (r[j] ^ s[j]);
    p[j] = s[j] ^ t;
    q[j] = r[j] ^ t;
  }
}

ساكن فراغ mainloop(بینښه صحيح work[64],ثابت بینښه حرف e[32])
{
  بینښه صحيح xzm1[64];
  بینښه صحيح xzm[64];
  بینښه صحيح xzmb[64];
  بینښه صحيح xzm1b[64];
  بینښه صحيح xznb[64];
  بینښه صحيح xzn1b[64];
  بینښه صحيح a0[64];
  بینښه صحيح a1[64];
  بینښه صحيح b0[64];
  بینښه صحيح b1[64];
  بینښه صحيح c1[64];
  بینښه صحيح r[32];
  بینښه صحيح s[32];
  بینښه صحيح t[32];
  بینښه صحيح u[32];
  بینښه صحيح j;
  بینښه صحيح b;
  صحيح pos;

  لكل (j = 0;j < 32;++j) xzm1[j] = work[j];
  xzm1[32] = 1;
  لكل (j = 33;j < 64;++j) xzm1[j] = 0;

  xzm[0] = 1;
  لكل (j = 1;j < 64;++j) xzm[j] = 0;

  لكل (pos = 254;pos >= 0;--pos) {
    b = e[pos / 8] >> (pos & 7);
    b &= 1;
    select(xzmb,xzm1b,xzm,xzm1,b);
    جمع_کړه(a0,xzmb,xzmb + 32);
    sub(a0 + 32,xzmb,xzmb + 32);
    جمع_کړه(a1,xzm1b,xzm1b + 32);
    sub(a1 + 32,xzm1b,xzm1b + 32);
    مربع(b0,a0);
    مربع(b0 + 32,a0 + 32);
    mult(b1,a1,a0 + 32);
    mult(b1 + 32,a1 + 32,a0);
    جمع_کړه(c1,b1,b1 + 32);
    sub(c1 + 32,b1,b1 + 32);
    مربع(r,c1 + 32);
    sub(s,b0,b0 + 32);
    mult121665(t,s);
    جمع_کړه(u,t,b0);
    mult(xznb,b0,b0 + 32);
    mult(xznb + 32,s,u);
    مربع(xzn1b,c1);
    mult(xzn1b + 32,r,work);
    select(xzm,xzm1,xznb,xzn1b,b);
  }

  لكل (j = 0;j < 64;++j) work[j] = xzm[j];
}

ساكن فراغ recip(بینښه صحيح بهر[32],ثابت بینښه صحيح z[32])
{
  بینښه صحيح z2[32];
  بینښه صحيح z9[32];
  بینښه صحيح z11[32];
  بینښه صحيح z2_5_0[32];
  بینښه صحيح z2_10_0[32];
  بینښه صحيح z2_20_0[32];
  بینښه صحيح z2_50_0[32];
  بینښه صحيح z2_100_0[32];
  بینښه صحيح t0[32];
  بینښه صحيح t1[32];
  صحيح i;

  /* 2 */ مربع(z2,z);
  /* 4 */ مربع(t1,z2);
  /* 8 */ مربع(t0,t1);
  /* 9 */ mult(z9,t0,z);
  /* 11 */ mult(z11,z9,z2);
  /* 22 */ مربع(t0,z11);
  /* 2^5 - 2^0 = 31 */ mult(z2_5_0,t0,z9);

  /* 2^6 - 2^1 */ مربع(t0,z2_5_0);
  /* 2^7 - 2^2 */ مربع(t1,t0);
  /* 2^8 - 2^3 */ مربع(t0,t1);
  /* 2^9 - 2^4 */ مربع(t1,t0);
  /* 2^10 - 2^5 */ مربع(t0,t1);
  /* 2^10 - 2^0 */ mult(z2_10_0,t0,z2_5_0);

  /* 2^11 - 2^1 */ مربع(t0,z2_10_0);
  /* 2^12 - 2^2 */ مربع(t1,t0);
  /* 2^20 - 2^10 */ لكل (i = 2;i < 10;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^20 - 2^0 */ mult(z2_20_0,t1,z2_10_0);

  /* 2^21 - 2^1 */ مربع(t0,z2_20_0);
  /* 2^22 - 2^2 */ مربع(t1,t0);
  /* 2^40 - 2^20 */ لكل (i = 2;i < 20;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^40 - 2^0 */ mult(t0,t1,z2_20_0);

  /* 2^41 - 2^1 */ مربع(t1,t0);
  /* 2^42 - 2^2 */ مربع(t0,t1);
  /* 2^50 - 2^10 */ لكل (i = 2;i < 10;i += 2) { مربع(t1,t0); مربع(t0,t1); }
  /* 2^50 - 2^0 */ mult(z2_50_0,t0,z2_10_0);

  /* 2^51 - 2^1 */ مربع(t0,z2_50_0);
  /* 2^52 - 2^2 */ مربع(t1,t0);
  /* 2^100 - 2^50 */ لكل (i = 2;i < 50;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^100 - 2^0 */ mult(z2_100_0,t1,z2_50_0);

  /* 2^101 - 2^1 */ مربع(t1,z2_100_0);
  /* 2^102 - 2^2 */ مربع(t0,t1);
  /* 2^200 - 2^100 */ لكل (i = 2;i < 100;i += 2) { مربع(t1,t0); مربع(t0,t1); }
  /* 2^200 - 2^0 */ mult(t1,t0,z2_100_0);

  /* 2^201 - 2^1 */ مربع(t0,t1);
  /* 2^202 - 2^2 */ مربع(t1,t0);
  /* 2^250 - 2^50 */ لكل (i = 2;i < 50;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^250 - 2^0 */ mult(t0,t1,z2_50_0);

  /* 2^251 - 2^1 */ مربع(t1,t0);
  /* 2^252 - 2^2 */ مربع(t0,t1);
  /* 2^253 - 2^3 */ مربع(t1,t0);
  /* 2^254 - 2^4 */ مربع(t0,t1);
  /* 2^255 - 2^5 */ مربع(t1,t0);
  /* 2^255 - 21 */ mult(بهر,t1,z11);
}

صحيح crypto_scalarmult_curve25519(بینښه حرف *q,
  ثابت بینښه حرف *n,
  ثابت بینښه حرف *p)
{
  بینښه صحيح work[96];
  بینښه حرف e[32];
  بینښه صحيح i;
  لكل (i = 0;i < 32;++i) e[i] = n[i];
  e[0] &= 248;
  e[31] &= 127;
  e[31] |= 64;
  لكل (i = 0;i < 32;++i) work[i] = p[i];
  mainloop(work,e);
  recip(work + 32,work + 32);
  mult(work + 64,work,work + 32);
  freeze(work + 64);
  لكل (i = 0;i < 32;++i) q[i] = work[64 + i];
  أرجع 0;
}
