/* $OpenBSD: smult_curve25519_ref.c,v 1.2 2013/11/02 22:02:14 markus Exp $ */
/*
version 20081011
Matthew Dempsky
Public domain.
Derived from public domain code by D. J. Bernstein.
*/

పూర్ణాంకం crypto_scalarmult_curve25519(గుర్తులేని అక్షరం *, స్థిరరాశి గుర్తులేని అక్షరం *, స్థిరరాశి గుర్తులేని అక్షరం *);

స్థిర శూన్య కూడు(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం a[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం b[32])
{
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;
  u = 0;
  కొరకు (j = 0;j < 31;++j) { u += a[j] + b[j]; బహిర్గతం[j] = u & 255; u >>= 8; }
  u += a[31] + b[31]; బహిర్గతం[31] = u;
}

స్థిర శూన్య sub(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం a[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం b[32])
{
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;
  u = 218;
  కొరకు (j = 0;j < 31;++j) {
    u += a[j] + 65280 - b[j];
    బహిర్గతం[j] = u & 255;
    u >>= 8;
  }
  u += a[31] - b[31];
  బహిర్గతం[31] = u;
}

స్థిర శూన్య squeeze(గుర్తులేని పూర్ణాంకం a[32])
{
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;
  u = 0;
  కొరకు (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u & 127;
  u = 19 * (u >> 7);
  కొరకు (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u;
}

స్థిర స్థిరరాశి గుర్తులేని పూర్ణాంకం minusp[32] = {
 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128
} ;

స్థిర శూన్య freeze(గుర్తులేని పూర్ణాంకం a[32])
{
  గుర్తులేని పూర్ణాంకం aorig[32];
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం negative;

  కొరకు (j = 0;j < 32;++j) aorig[j] = a[j];
  కూడు(a,a,minusp);
  negative = -((a[31] >> 7) & 1);
  కొరకు (j = 0;j < 32;++j) a[j] ^= negative & (aorig[j] ^ a[j]);
}

స్థిర శూన్య mult(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం a[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం b[32])
{
  గుర్తులేని పూర్ణాంకం i;
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;

  కొరకు (i = 0;i < 32;++i) {
    u = 0;
    కొరకు (j = 0;j <= i;++j) u += a[j] * b[i - j];
    కొరకు (j = i + 1;j < 32;++j) u += 38 * a[j] * b[i + 32 - j];
    బహిర్గతం[i] = u;
  }
  squeeze(బహిర్గతం);
}

స్థిర శూన్య mult121665(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం a[32])
{
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;

  u = 0;
  కొరకు (j = 0;j < 31;++j) { u += 121665 * a[j]; బహిర్గతం[j] = u & 255; u >>= 8; }
  u += 121665 * a[31]; బహిర్గతం[31] = u & 127;
  u = 19 * (u >> 7);
  కొరకు (j = 0;j < 31;++j) { u += బహిర్గతం[j]; బహిర్గతం[j] = u & 255; u >>= 8; }
  u += బహిర్గతం[j]; బహిర్గతం[j] = u;
}

స్థిర శూన్య వర్గం(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం a[32])
{
  గుర్తులేని పూర్ణాంకం i;
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం u;

  కొరకు (i = 0;i < 32;++i) {
    u = 0;
    కొరకు (j = 0;j < i - j;++j) u += a[j] * a[i - j];
    కొరకు (j = i + 1;j < i + 32 - j;++j) u += 38 * a[j] * a[i + 32 - j];
    u *= 2;
    ఒకవేళ ((i & 1) == 0) {
      u += a[i / 2] * a[i / 2];
      u += 38 * a[i / 2 + 16] * a[i / 2 + 16];
    }
    బహిర్గతం[i] = u;
  }
  squeeze(బహిర్గతం);
}

స్థిర శూన్య select(గుర్తులేని పూర్ణాంకం p[64],గుర్తులేని పూర్ణాంకం q[64],స్థిరరాశి గుర్తులేని పూర్ణాంకం r[64],స్థిరరాశి గుర్తులేని పూర్ణాంకం s[64],గుర్తులేని పూర్ణాంకం b)
{
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం t;
  గుర్తులేని పూర్ణాంకం bminus1;

  bminus1 = b - 1;
  కొరకు (j = 0;j < 64;++j) {
    t = bminus1 & (r[j] ^ s[j]);
    p[j] = s[j] ^ t;
    q[j] = r[j] ^ t;
  }
}

స్థిర శూన్య mainloop(గుర్తులేని పూర్ణాంకం work[64],స్థిరరాశి గుర్తులేని అక్షరం e[32])
{
  గుర్తులేని పూర్ణాంకం xzm1[64];
  గుర్తులేని పూర్ణాంకం xzm[64];
  గుర్తులేని పూర్ణాంకం xzmb[64];
  గుర్తులేని పూర్ణాంకం xzm1b[64];
  గుర్తులేని పూర్ణాంకం xznb[64];
  గుర్తులేని పూర్ణాంకం xzn1b[64];
  గుర్తులేని పూర్ణాంకం a0[64];
  గుర్తులేని పూర్ణాంకం a1[64];
  గుర్తులేని పూర్ణాంకం b0[64];
  గుర్తులేని పూర్ణాంకం b1[64];
  గుర్తులేని పూర్ణాంకం c1[64];
  గుర్తులేని పూర్ణాంకం r[32];
  గుర్తులేని పూర్ణాంకం s[32];
  గుర్తులేని పూర్ణాంకం t[32];
  గుర్తులేని పూర్ణాంకం u[32];
  గుర్తులేని పూర్ణాంకం j;
  గుర్తులేని పూర్ణాంకం b;
  పూర్ణాంకం pos;

  కొరకు (j = 0;j < 32;++j) xzm1[j] = work[j];
  xzm1[32] = 1;
  కొరకు (j = 33;j < 64;++j) xzm1[j] = 0;

  xzm[0] = 1;
  కొరకు (j = 1;j < 64;++j) xzm[j] = 0;

  కొరకు (pos = 254;pos >= 0;--pos) {
    b = e[pos / 8] >> (pos & 7);
    b &= 1;
    select(xzmb,xzm1b,xzm,xzm1,b);
    కూడు(a0,xzmb,xzmb + 32);
    sub(a0 + 32,xzmb,xzmb + 32);
    కూడు(a1,xzm1b,xzm1b + 32);
    sub(a1 + 32,xzm1b,xzm1b + 32);
    వర్గం(b0,a0);
    వర్గం(b0 + 32,a0 + 32);
    mult(b1,a1,a0 + 32);
    mult(b1 + 32,a1 + 32,a0);
    కూడు(c1,b1,b1 + 32);
    sub(c1 + 32,b1,b1 + 32);
    వర్గం(r,c1 + 32);
    sub(s,b0,b0 + 32);
    mult121665(t,s);
    కూడు(u,t,b0);
    mult(xznb,b0,b0 + 32);
    mult(xznb + 32,s,u);
    వర్గం(xzn1b,c1);
    mult(xzn1b + 32,r,work);
    select(xzm,xzm1,xznb,xzn1b,b);
  }

  కొరకు (j = 0;j < 64;++j) work[j] = xzm[j];
}

స్థిర శూన్య recip(గుర్తులేని పూర్ణాంకం బహిర్గతం[32],స్థిరరాశి గుర్తులేని పూర్ణాంకం z[32])
{
  గుర్తులేని పూర్ణాంకం z2[32];
  గుర్తులేని పూర్ణాంకం z9[32];
  గుర్తులేని పూర్ణాంకం z11[32];
  గుర్తులేని పూర్ణాంకం z2_5_0[32];
  గుర్తులేని పూర్ణాంకం z2_10_0[32];
  గుర్తులేని పూర్ణాంకం z2_20_0[32];
  గుర్తులేని పూర్ణాంకం z2_50_0[32];
  గుర్తులేని పూర్ణాంకం z2_100_0[32];
  గుర్తులేని పూర్ణాంకం t0[32];
  గుర్తులేని పూర్ణాంకం t1[32];
  పూర్ణాంకం i;

  /* 2 */ వర్గం(z2,z);
  /* 4 */ వర్గం(t1,z2);
  /* 8 */ వర్గం(t0,t1);
  /* 9 */ mult(z9,t0,z);
  /* 11 */ mult(z11,z9,z2);
  /* 22 */ వర్గం(t0,z11);
  /* 2^5 - 2^0 = 31 */ mult(z2_5_0,t0,z9);

  /* 2^6 - 2^1 */ వర్గం(t0,z2_5_0);
  /* 2^7 - 2^2 */ వర్గం(t1,t0);
  /* 2^8 - 2^3 */ వర్గం(t0,t1);
  /* 2^9 - 2^4 */ వర్గం(t1,t0);
  /* 2^10 - 2^5 */ వర్గం(t0,t1);
  /* 2^10 - 2^0 */ mult(z2_10_0,t0,z2_5_0);

  /* 2^11 - 2^1 */ వర్గం(t0,z2_10_0);
  /* 2^12 - 2^2 */ వర్గం(t1,t0);
  /* 2^20 - 2^10 */ కొరకు (i = 2;i < 10;i += 2) { వర్గం(t0,t1); వర్గం(t1,t0); }
  /* 2^20 - 2^0 */ mult(z2_20_0,t1,z2_10_0);

  /* 2^21 - 2^1 */ వర్గం(t0,z2_20_0);
  /* 2^22 - 2^2 */ వర్గం(t1,t0);
  /* 2^40 - 2^20 */ కొరకు (i = 2;i < 20;i += 2) { వర్గం(t0,t1); వర్గం(t1,t0); }
  /* 2^40 - 2^0 */ mult(t0,t1,z2_20_0);

  /* 2^41 - 2^1 */ వర్గం(t1,t0);
  /* 2^42 - 2^2 */ వర్గం(t0,t1);
  /* 2^50 - 2^10 */ కొరకు (i = 2;i < 10;i += 2) { వర్గం(t1,t0); వర్గం(t0,t1); }
  /* 2^50 - 2^0 */ mult(z2_50_0,t0,z2_10_0);

  /* 2^51 - 2^1 */ వర్గం(t0,z2_50_0);
  /* 2^52 - 2^2 */ వర్గం(t1,t0);
  /* 2^100 - 2^50 */ కొరకు (i = 2;i < 50;i += 2) { వర్గం(t0,t1); వర్గం(t1,t0); }
  /* 2^100 - 2^0 */ mult(z2_100_0,t1,z2_50_0);

  /* 2^101 - 2^1 */ వర్గం(t1,z2_100_0);
  /* 2^102 - 2^2 */ వర్గం(t0,t1);
  /* 2^200 - 2^100 */ కొరకు (i = 2;i < 100;i += 2) { వర్గం(t1,t0); వర్గం(t0,t1); }
  /* 2^200 - 2^0 */ mult(t1,t0,z2_100_0);

  /* 2^201 - 2^1 */ వర్గం(t0,t1);
  /* 2^202 - 2^2 */ వర్గం(t1,t0);
  /* 2^250 - 2^50 */ కొరకు (i = 2;i < 50;i += 2) { వర్గం(t0,t1); వర్గం(t1,t0); }
  /* 2^250 - 2^0 */ mult(t0,t1,z2_50_0);

  /* 2^251 - 2^1 */ వర్గం(t1,t0);
  /* 2^252 - 2^2 */ వర్గం(t0,t1);
  /* 2^253 - 2^3 */ వర్గం(t1,t0);
  /* 2^254 - 2^4 */ వర్గం(t0,t1);
  /* 2^255 - 2^5 */ వర్గం(t1,t0);
  /* 2^255 - 21 */ mult(బహిర్గతం,t1,z11);
}

పూర్ణాంకం crypto_scalarmult_curve25519(గుర్తులేని అక్షరం *q,
  స్థిరరాశి గుర్తులేని అక్షరం *n,
  స్థిరరాశి గుర్తులేని అక్షరం *p)
{
  గుర్తులేని పూర్ణాంకం work[96];
  గుర్తులేని అక్షరం e[32];
  గుర్తులేని పూర్ణాంకం i;
  కొరకు (i = 0;i < 32;++i) e[i] = n[i];
  e[0] &= 248;
  e[31] &= 127;
  e[31] |= 64;
  కొరకు (i = 0;i < 32;++i) work[i] = p[i];
  mainloop(work,e);
  recip(work + 32,work + 32);
  mult(work + 64,work,work + 32);
  freeze(work + 64);
  కొరకు (i = 0;i < 32;++i) q[i] = work[64 + i];
  తిరిగి 0;
}
