/* $OpenBSD: smult_curve25519_ref.c,v 1.2 2013/11/02 22:02:14 markus Exp $ */
/*
version 20081011
Matthew Dempsky
Public domain.
Derived from public domain code by D. J. Bernstein.
*/

ਪੂਰਨ crypto_scalarmult_curve25519(ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *, ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *, ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *);

ਸਥਿਰ ਖਾਲੀ ਜੋੜੋ(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;
  u = 0;
  ਲਈ (j = 0;j < 31;++j) { u += a[j] + b[j]; ਬਾਹਰਲਾ[j] = u & 255; u >>= 8; }
  u += a[31] + b[31]; ਬਾਹਰਲਾ[31] = u;
}

ਸਥਿਰ ਖਾਲੀ sub(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;
  u = 218;
  ਲਈ (j = 0;j < 31;++j) {
    u += a[j] + 65280 - b[j];
    ਬਾਹਰਲਾ[j] = u & 255;
    u >>= 8;
  }
  u += a[31] - b[31];
  ਬਾਹਰਲਾ[31] = u;
}

ਸਥਿਰ ਖਾਲੀ squeeze(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;
  u = 0;
  ਲਈ (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u & 127;
  u = 19 * (u >> 7);
  ਲਈ (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u;
}

ਸਥਿਰ ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ minusp[32] = {
 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128
} ;

ਸਥਿਰ ਖਾਲੀ freeze(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ aorig[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ negative;

  ਲਈ (j = 0;j < 32;++j) aorig[j] = a[j];
  ਜੋੜੋ(a,a,minusp);
  negative = -((a[31] >> 7) & 1);
  ਲਈ (j = 0;j < 32;++j) a[j] ^= negative & (aorig[j] ^ a[j]);
}

ਸਥਿਰ ਖਾਲੀ mult(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ i;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;

  ਲਈ (i = 0;i < 32;++i) {
    u = 0;
    ਲਈ (j = 0;j <= i;++j) u += a[j] * b[i - j];
    ਲਈ (j = i + 1;j < 32;++j) u += 38 * a[j] * b[i + 32 - j];
    ਬਾਹਰਲਾ[i] = u;
  }
  squeeze(ਬਾਹਰਲਾ);
}

ਸਥਿਰ ਖਾਲੀ mult121665(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;

  u = 0;
  ਲਈ (j = 0;j < 31;++j) { u += 121665 * a[j]; ਬਾਹਰਲਾ[j] = u & 255; u >>= 8; }
  u += 121665 * a[31]; ਬਾਹਰਲਾ[31] = u & 127;
  u = 19 * (u >> 7);
  ਲਈ (j = 0;j < 31;++j) { u += ਬਾਹਰਲਾ[j]; ਬਾਹਰਲਾ[j] = u & 255; u >>= 8; }
  u += ਬਾਹਰਲਾ[j]; ਬਾਹਰਲਾ[j] = u;
}

ਸਥਿਰ ਖਾਲੀ ਵਰਗਫਲ(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ i;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u;

  ਲਈ (i = 0;i < 32;++i) {
    u = 0;
    ਲਈ (j = 0;j < i - j;++j) u += a[j] * a[i - j];
    ਲਈ (j = i + 1;j < i + 32 - j;++j) u += 38 * a[j] * a[i + 32 - j];
    u *= 2;
    ਜੇ ((i & 1) == 0) {
      u += a[i / 2] * a[i / 2];
      u += 38 * a[i / 2 + 16] * a[i / 2 + 16];
    }
    ਬਾਹਰਲਾ[i] = u;
  }
  squeeze(ਬਾਹਰਲਾ);
}

ਸਥਿਰ ਖਾਲੀ select(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ p[64],ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ q[64],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ r[64],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ s[64],ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b)
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ t;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ bminus1;

  bminus1 = b - 1;
  ਲਈ (j = 0;j < 64;++j) {
    t = bminus1 & (r[j] ^ s[j]);
    p[j] = s[j] ^ t;
    q[j] = r[j] ^ t;
  }
}

ਸਥਿਰ ਖਾਲੀ mainloop(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ work[64],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ e[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xzm1[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xzm[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xzmb[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xzm1b[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xznb[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ xzn1b[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a0[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ a1[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b0[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b1[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ c1[64];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ r[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ s[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ t[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ u[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ j;
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ b;
  ਪੂਰਨ pos;

  ਲਈ (j = 0;j < 32;++j) xzm1[j] = work[j];
  xzm1[32] = 1;
  ਲਈ (j = 33;j < 64;++j) xzm1[j] = 0;

  xzm[0] = 1;
  ਲਈ (j = 1;j < 64;++j) xzm[j] = 0;

  ਲਈ (pos = 254;pos >= 0;--pos) {
    b = e[pos / 8] >> (pos & 7);
    b &= 1;
    select(xzmb,xzm1b,xzm,xzm1,b);
    ਜੋੜੋ(a0,xzmb,xzmb + 32);
    sub(a0 + 32,xzmb,xzmb + 32);
    ਜੋੜੋ(a1,xzm1b,xzm1b + 32);
    sub(a1 + 32,xzm1b,xzm1b + 32);
    ਵਰਗਫਲ(b0,a0);
    ਵਰਗਫਲ(b0 + 32,a0 + 32);
    mult(b1,a1,a0 + 32);
    mult(b1 + 32,a1 + 32,a0);
    ਜੋੜੋ(c1,b1,b1 + 32);
    sub(c1 + 32,b1,b1 + 32);
    ਵਰਗਫਲ(r,c1 + 32);
    sub(s,b0,b0 + 32);
    mult121665(t,s);
    ਜੋੜੋ(u,t,b0);
    mult(xznb,b0,b0 + 32);
    mult(xznb + 32,s,u);
    ਵਰਗਫਲ(xzn1b,c1);
    mult(xzn1b + 32,r,work);
    select(xzm,xzm1,xznb,xzn1b,b);
  }

  ਲਈ (j = 0;j < 64;++j) work[j] = xzm[j];
}

ਸਥਿਰ ਖਾਲੀ recip(ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ ਬਾਹਰਲਾ[32],ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z[32])
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z9[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z11[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2_5_0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2_10_0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2_20_0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2_50_0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ z2_100_0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ t0[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ t1[32];
  ਪੂਰਨ i;

  /* 2 */ ਵਰਗਫਲ(z2,z);
  /* 4 */ ਵਰਗਫਲ(t1,z2);
  /* 8 */ ਵਰਗਫਲ(t0,t1);
  /* 9 */ mult(z9,t0,z);
  /* 11 */ mult(z11,z9,z2);
  /* 22 */ ਵਰਗਫਲ(t0,z11);
  /* 2^5 - 2^0 = 31 */ mult(z2_5_0,t0,z9);

  /* 2^6 - 2^1 */ ਵਰਗਫਲ(t0,z2_5_0);
  /* 2^7 - 2^2 */ ਵਰਗਫਲ(t1,t0);
  /* 2^8 - 2^3 */ ਵਰਗਫਲ(t0,t1);
  /* 2^9 - 2^4 */ ਵਰਗਫਲ(t1,t0);
  /* 2^10 - 2^5 */ ਵਰਗਫਲ(t0,t1);
  /* 2^10 - 2^0 */ mult(z2_10_0,t0,z2_5_0);

  /* 2^11 - 2^1 */ ਵਰਗਫਲ(t0,z2_10_0);
  /* 2^12 - 2^2 */ ਵਰਗਫਲ(t1,t0);
  /* 2^20 - 2^10 */ ਲਈ (i = 2;i < 10;i += 2) { ਵਰਗਫਲ(t0,t1); ਵਰਗਫਲ(t1,t0); }
  /* 2^20 - 2^0 */ mult(z2_20_0,t1,z2_10_0);

  /* 2^21 - 2^1 */ ਵਰਗਫਲ(t0,z2_20_0);
  /* 2^22 - 2^2 */ ਵਰਗਫਲ(t1,t0);
  /* 2^40 - 2^20 */ ਲਈ (i = 2;i < 20;i += 2) { ਵਰਗਫਲ(t0,t1); ਵਰਗਫਲ(t1,t0); }
  /* 2^40 - 2^0 */ mult(t0,t1,z2_20_0);

  /* 2^41 - 2^1 */ ਵਰਗਫਲ(t1,t0);
  /* 2^42 - 2^2 */ ਵਰਗਫਲ(t0,t1);
  /* 2^50 - 2^10 */ ਲਈ (i = 2;i < 10;i += 2) { ਵਰਗਫਲ(t1,t0); ਵਰਗਫਲ(t0,t1); }
  /* 2^50 - 2^0 */ mult(z2_50_0,t0,z2_10_0);

  /* 2^51 - 2^1 */ ਵਰਗਫਲ(t0,z2_50_0);
  /* 2^52 - 2^2 */ ਵਰਗਫਲ(t1,t0);
  /* 2^100 - 2^50 */ ਲਈ (i = 2;i < 50;i += 2) { ਵਰਗਫਲ(t0,t1); ਵਰਗਫਲ(t1,t0); }
  /* 2^100 - 2^0 */ mult(z2_100_0,t1,z2_50_0);

  /* 2^101 - 2^1 */ ਵਰਗਫਲ(t1,z2_100_0);
  /* 2^102 - 2^2 */ ਵਰਗਫਲ(t0,t1);
  /* 2^200 - 2^100 */ ਲਈ (i = 2;i < 100;i += 2) { ਵਰਗਫਲ(t1,t0); ਵਰਗਫਲ(t0,t1); }
  /* 2^200 - 2^0 */ mult(t1,t0,z2_100_0);

  /* 2^201 - 2^1 */ ਵਰਗਫਲ(t0,t1);
  /* 2^202 - 2^2 */ ਵਰਗਫਲ(t1,t0);
  /* 2^250 - 2^50 */ ਲਈ (i = 2;i < 50;i += 2) { ਵਰਗਫਲ(t0,t1); ਵਰਗਫਲ(t1,t0); }
  /* 2^250 - 2^0 */ mult(t0,t1,z2_50_0);

  /* 2^251 - 2^1 */ ਵਰਗਫਲ(t1,t0);
  /* 2^252 - 2^2 */ ਵਰਗਫਲ(t0,t1);
  /* 2^253 - 2^3 */ ਵਰਗਫਲ(t1,t0);
  /* 2^254 - 2^4 */ ਵਰਗਫਲ(t0,t1);
  /* 2^255 - 2^5 */ ਵਰਗਫਲ(t1,t0);
  /* 2^255 - 21 */ mult(ਬਾਹਰਲਾ,t1,z11);
}

ਪੂਰਨ crypto_scalarmult_curve25519(ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *q,
  ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *n,
  ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *p)
{
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ work[96];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ e[32];
  ਬਿਨਾਨਿਸ਼ਾਨੀ ਪੂਰਨ i;
  ਲਈ (i = 0;i < 32;++i) e[i] = n[i];
  e[0] &= 248;
  e[31] &= 127;
  e[31] |= 64;
  ਲਈ (i = 0;i < 32;++i) work[i] = p[i];
  mainloop(work,e);
  recip(work + 32,work + 32);
  mult(work + 64,work,work + 32);
  freeze(work + 64);
  ਲਈ (i = 0;i < 32;++i) q[i] = work[64 + i];
  ਵਾਪਸ 0;
}
