/* $OpenBSD: smult_curve25519_ref.c,v 1.2 2013/11/02 22:02:14 markus Exp $ */
/*
version 20081011
Matthew Dempsky
Public domain.
Derived from public domain code by D. J. Bernstein.
*/

صحیح crypto_scalarmult_curve25519(غیرعلامتی حرف *, ثابت غیرعلامتی حرف *, ثابت غیرعلامتی حرف *);

ساکن خالی جوڑو(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح a[32],ثابت غیرعلامتی صحیح b[32])
{
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;
  u = 0;
  برائے (j = 0;j < 31;++j) { u += a[j] + b[j]; برآمد[j] = u & 255; u >>= 8; }
  u += a[31] + b[31]; برآمد[31] = u;
}

ساکن خالی sub(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح a[32],ثابت غیرعلامتی صحیح b[32])
{
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;
  u = 218;
  برائے (j = 0;j < 31;++j) {
    u += a[j] + 65280 - b[j];
    برآمد[j] = u & 255;
    u >>= 8;
  }
  u += a[31] - b[31];
  برآمد[31] = u;
}

ساکن خالی squeeze(غیرعلامتی صحیح a[32])
{
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;
  u = 0;
  برائے (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u & 127;
  u = 19 * (u >> 7);
  برائے (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u;
}

ساکن ثابت غیرعلامتی صحیح minusp[32] = {
 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128
} ;

ساکن خالی freeze(غیرعلامتی صحیح a[32])
{
  غیرعلامتی صحیح aorig[32];
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح negative;

  برائے (j = 0;j < 32;++j) aorig[j] = a[j];
  جوڑو(a,a,minusp);
  negative = -((a[31] >> 7) & 1);
  برائے (j = 0;j < 32;++j) a[j] ^= negative & (aorig[j] ^ a[j]);
}

ساکن خالی mult(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح a[32],ثابت غیرعلامتی صحیح b[32])
{
  غیرعلامتی صحیح i;
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;

  برائے (i = 0;i < 32;++i) {
    u = 0;
    برائے (j = 0;j <= i;++j) u += a[j] * b[i - j];
    برائے (j = i + 1;j < 32;++j) u += 38 * a[j] * b[i + 32 - j];
    برآمد[i] = u;
  }
  squeeze(برآمد);
}

ساکن خالی mult121665(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح a[32])
{
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;

  u = 0;
  برائے (j = 0;j < 31;++j) { u += 121665 * a[j]; برآمد[j] = u & 255; u >>= 8; }
  u += 121665 * a[31]; برآمد[31] = u & 127;
  u = 19 * (u >> 7);
  برائے (j = 0;j < 31;++j) { u += برآمد[j]; برآمد[j] = u & 255; u >>= 8; }
  u += برآمد[j]; برآمد[j] = u;
}

ساکن خالی مربع(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح a[32])
{
  غیرعلامتی صحیح i;
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح u;

  برائے (i = 0;i < 32;++i) {
    u = 0;
    برائے (j = 0;j < i - j;++j) u += a[j] * a[i - j];
    برائے (j = i + 1;j < i + 32 - j;++j) u += 38 * a[j] * a[i + 32 - j];
    u *= 2;
    اگر ((i & 1) == 0) {
      u += a[i / 2] * a[i / 2];
      u += 38 * a[i / 2 + 16] * a[i / 2 + 16];
    }
    برآمد[i] = u;
  }
  squeeze(برآمد);
}

ساکن خالی select(غیرعلامتی صحیح p[64],غیرعلامتی صحیح q[64],ثابت غیرعلامتی صحیح r[64],ثابت غیرعلامتی صحیح s[64],غیرعلامتی صحیح b)
{
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح t;
  غیرعلامتی صحیح bminus1;

  bminus1 = b - 1;
  برائے (j = 0;j < 64;++j) {
    t = bminus1 & (r[j] ^ s[j]);
    p[j] = s[j] ^ t;
    q[j] = r[j] ^ t;
  }
}

ساکن خالی mainloop(غیرعلامتی صحیح work[64],ثابت غیرعلامتی حرف e[32])
{
  غیرعلامتی صحیح xzm1[64];
  غیرعلامتی صحیح xzm[64];
  غیرعلامتی صحیح xzmb[64];
  غیرعلامتی صحیح xzm1b[64];
  غیرعلامتی صحیح xznb[64];
  غیرعلامتی صحیح xzn1b[64];
  غیرعلامتی صحیح a0[64];
  غیرعلامتی صحیح a1[64];
  غیرعلامتی صحیح b0[64];
  غیرعلامتی صحیح b1[64];
  غیرعلامتی صحیح c1[64];
  غیرعلامتی صحیح r[32];
  غیرعلامتی صحیح s[32];
  غیرعلامتی صحیح t[32];
  غیرعلامتی صحیح u[32];
  غیرعلامتی صحیح j;
  غیرعلامتی صحیح b;
  صحیح pos;

  برائے (j = 0;j < 32;++j) xzm1[j] = work[j];
  xzm1[32] = 1;
  برائے (j = 33;j < 64;++j) xzm1[j] = 0;

  xzm[0] = 1;
  برائے (j = 1;j < 64;++j) xzm[j] = 0;

  برائے (pos = 254;pos >= 0;--pos) {
    b = e[pos / 8] >> (pos & 7);
    b &= 1;
    select(xzmb,xzm1b,xzm,xzm1,b);
    جوڑو(a0,xzmb,xzmb + 32);
    sub(a0 + 32,xzmb,xzmb + 32);
    جوڑو(a1,xzm1b,xzm1b + 32);
    sub(a1 + 32,xzm1b,xzm1b + 32);
    مربع(b0,a0);
    مربع(b0 + 32,a0 + 32);
    mult(b1,a1,a0 + 32);
    mult(b1 + 32,a1 + 32,a0);
    جوڑو(c1,b1,b1 + 32);
    sub(c1 + 32,b1,b1 + 32);
    مربع(r,c1 + 32);
    sub(s,b0,b0 + 32);
    mult121665(t,s);
    جوڑو(u,t,b0);
    mult(xznb,b0,b0 + 32);
    mult(xznb + 32,s,u);
    مربع(xzn1b,c1);
    mult(xzn1b + 32,r,work);
    select(xzm,xzm1,xznb,xzn1b,b);
  }

  برائے (j = 0;j < 64;++j) work[j] = xzm[j];
}

ساکن خالی recip(غیرعلامتی صحیح برآمد[32],ثابت غیرعلامتی صحیح z[32])
{
  غیرعلامتی صحیح z2[32];
  غیرعلامتی صحیح z9[32];
  غیرعلامتی صحیح z11[32];
  غیرعلامتی صحیح z2_5_0[32];
  غیرعلامتی صحیح z2_10_0[32];
  غیرعلامتی صحیح z2_20_0[32];
  غیرعلامتی صحیح z2_50_0[32];
  غیرعلامتی صحیح z2_100_0[32];
  غیرعلامتی صحیح t0[32];
  غیرعلامتی صحیح t1[32];
  صحیح i;

  /* 2 */ مربع(z2,z);
  /* 4 */ مربع(t1,z2);
  /* 8 */ مربع(t0,t1);
  /* 9 */ mult(z9,t0,z);
  /* 11 */ mult(z11,z9,z2);
  /* 22 */ مربع(t0,z11);
  /* 2^5 - 2^0 = 31 */ mult(z2_5_0,t0,z9);

  /* 2^6 - 2^1 */ مربع(t0,z2_5_0);
  /* 2^7 - 2^2 */ مربع(t1,t0);
  /* 2^8 - 2^3 */ مربع(t0,t1);
  /* 2^9 - 2^4 */ مربع(t1,t0);
  /* 2^10 - 2^5 */ مربع(t0,t1);
  /* 2^10 - 2^0 */ mult(z2_10_0,t0,z2_5_0);

  /* 2^11 - 2^1 */ مربع(t0,z2_10_0);
  /* 2^12 - 2^2 */ مربع(t1,t0);
  /* 2^20 - 2^10 */ برائے (i = 2;i < 10;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^20 - 2^0 */ mult(z2_20_0,t1,z2_10_0);

  /* 2^21 - 2^1 */ مربع(t0,z2_20_0);
  /* 2^22 - 2^2 */ مربع(t1,t0);
  /* 2^40 - 2^20 */ برائے (i = 2;i < 20;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^40 - 2^0 */ mult(t0,t1,z2_20_0);

  /* 2^41 - 2^1 */ مربع(t1,t0);
  /* 2^42 - 2^2 */ مربع(t0,t1);
  /* 2^50 - 2^10 */ برائے (i = 2;i < 10;i += 2) { مربع(t1,t0); مربع(t0,t1); }
  /* 2^50 - 2^0 */ mult(z2_50_0,t0,z2_10_0);

  /* 2^51 - 2^1 */ مربع(t0,z2_50_0);
  /* 2^52 - 2^2 */ مربع(t1,t0);
  /* 2^100 - 2^50 */ برائے (i = 2;i < 50;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^100 - 2^0 */ mult(z2_100_0,t1,z2_50_0);

  /* 2^101 - 2^1 */ مربع(t1,z2_100_0);
  /* 2^102 - 2^2 */ مربع(t0,t1);
  /* 2^200 - 2^100 */ برائے (i = 2;i < 100;i += 2) { مربع(t1,t0); مربع(t0,t1); }
  /* 2^200 - 2^0 */ mult(t1,t0,z2_100_0);

  /* 2^201 - 2^1 */ مربع(t0,t1);
  /* 2^202 - 2^2 */ مربع(t1,t0);
  /* 2^250 - 2^50 */ برائے (i = 2;i < 50;i += 2) { مربع(t0,t1); مربع(t1,t0); }
  /* 2^250 - 2^0 */ mult(t0,t1,z2_50_0);

  /* 2^251 - 2^1 */ مربع(t1,t0);
  /* 2^252 - 2^2 */ مربع(t0,t1);
  /* 2^253 - 2^3 */ مربع(t1,t0);
  /* 2^254 - 2^4 */ مربع(t0,t1);
  /* 2^255 - 2^5 */ مربع(t1,t0);
  /* 2^255 - 21 */ mult(برآمد,t1,z11);
}

صحیح crypto_scalarmult_curve25519(غیرعلامتی حرف *q,
  ثابت غیرعلامتی حرف *n,
  ثابت غیرعلامتی حرف *p)
{
  غیرعلامتی صحیح work[96];
  غیرعلامتی حرف e[32];
  غیرعلامتی صحیح i;
  برائے (i = 0;i < 32;++i) e[i] = n[i];
  e[0] &= 248;
  e[31] &= 127;
  e[31] |= 64;
  برائے (i = 0;i < 32;++i) work[i] = p[i];
  mainloop(work,e);
  recip(work + 32,work + 32);
  mult(work + 64,work,work + 32);
  freeze(work + 64);
  برائے (i = 0;i < 32;++i) q[i] = work[64 + i];
  واپس 0;
}
