/* $OpenBSD: smult_curve25519_ref.c,v 1.2 2013/11/02 22:02:14 markus Exp $ */
/*
version 20081011
Matthew Dempsky
Public domain.
Derived from public domain code by D. J. Bernstein.
*/

ಪೂರ್ಣಾಂಕ crypto_scalarmult_curve25519(ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *, ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *, ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *);

ಸ್ಥಿರ ಶೂನ್ಯ ಕೂಡಿಸು(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;
  u = 0;
  ಗಾಗಿ (j = 0;j < 31;++j) { u += a[j] + b[j]; ಹೊರಹೋಗು[j] = u & 255; u >>= 8; }
  u += a[31] + b[31]; ಹೊರಹೋಗು[31] = u;
}

ಸ್ಥಿರ ಶೂನ್ಯ sub(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;
  u = 218;
  ಗಾಗಿ (j = 0;j < 31;++j) {
    u += a[j] + 65280 - b[j];
    ಹೊರಹೋಗು[j] = u & 255;
    u >>= 8;
  }
  u += a[31] - b[31];
  ಹೊರಹೋಗು[31] = u;
}

ಸ್ಥಿರ ಶೂನ್ಯ squeeze(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;
  u = 0;
  ಗಾಗಿ (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u & 127;
  u = 19 * (u >> 7);
  ಗಾಗಿ (j = 0;j < 31;++j) { u += a[j]; a[j] = u & 255; u >>= 8; }
  u += a[31]; a[31] = u;
}

ಸ್ಥಿರ ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ minusp[32] = {
 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 128
} ;

ಸ್ಥಿರ ಶೂನ್ಯ freeze(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ aorig[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ negative;

  ಗಾಗಿ (j = 0;j < 32;++j) aorig[j] = a[j];
  ಕೂಡಿಸು(a,a,minusp);
  negative = -((a[31] >> 7) & 1);
  ಗಾಗಿ (j = 0;j < 32;++j) a[j] ^= negative & (aorig[j] ^ a[j]);
}

ಸ್ಥಿರ ಶೂನ್ಯ mult(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ i;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;

  ಗಾಗಿ (i = 0;i < 32;++i) {
    u = 0;
    ಗಾಗಿ (j = 0;j <= i;++j) u += a[j] * b[i - j];
    ಗಾಗಿ (j = i + 1;j < 32;++j) u += 38 * a[j] * b[i + 32 - j];
    ಹೊರಹೋಗು[i] = u;
  }
  squeeze(ಹೊರಹೋಗು);
}

ಸ್ಥಿರ ಶೂನ್ಯ mult121665(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;

  u = 0;
  ಗಾಗಿ (j = 0;j < 31;++j) { u += 121665 * a[j]; ಹೊರಹೋಗು[j] = u & 255; u >>= 8; }
  u += 121665 * a[31]; ಹೊರಹೋಗು[31] = u & 127;
  u = 19 * (u >> 7);
  ಗಾಗಿ (j = 0;j < 31;++j) { u += ಹೊರಹೋಗು[j]; ಹೊರಹೋಗು[j] = u & 255; u >>= 8; }
  u += ಹೊರಹೋಗು[j]; ಹೊರಹೋಗು[j] = u;
}

ಸ್ಥಿರ ಶೂನ್ಯ ವರ್ಗಫಲ(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ i;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u;

  ಗಾಗಿ (i = 0;i < 32;++i) {
    u = 0;
    ಗಾಗಿ (j = 0;j < i - j;++j) u += a[j] * a[i - j];
    ಗಾಗಿ (j = i + 1;j < i + 32 - j;++j) u += 38 * a[j] * a[i + 32 - j];
    u *= 2;
    ಆದರೆ ((i & 1) == 0) {
      u += a[i / 2] * a[i / 2];
      u += 38 * a[i / 2 + 16] * a[i / 2 + 16];
    }
    ಹೊರಹೋಗು[i] = u;
  }
  squeeze(ಹೊರಹೋಗು);
}

ಸ್ಥಿರ ಶೂನ್ಯ select(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ p[64],ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ q[64],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ r[64],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ s[64],ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b)
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ t;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ bminus1;

  bminus1 = b - 1;
  ಗಾಗಿ (j = 0;j < 64;++j) {
    t = bminus1 & (r[j] ^ s[j]);
    p[j] = s[j] ^ t;
    q[j] = r[j] ^ t;
  }
}

ಸ್ಥಿರ ಶೂನ್ಯ mainloop(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ work[64],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ e[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xzm1[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xzm[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xzmb[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xzm1b[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xznb[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ xzn1b[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a0[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ a1[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b0[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b1[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ c1[64];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ r[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ s[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ t[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ u[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ j;
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ b;
  ಪೂರ್ಣಾಂಕ pos;

  ಗಾಗಿ (j = 0;j < 32;++j) xzm1[j] = work[j];
  xzm1[32] = 1;
  ಗಾಗಿ (j = 33;j < 64;++j) xzm1[j] = 0;

  xzm[0] = 1;
  ಗಾಗಿ (j = 1;j < 64;++j) xzm[j] = 0;

  ಗಾಗಿ (pos = 254;pos >= 0;--pos) {
    b = e[pos / 8] >> (pos & 7);
    b &= 1;
    select(xzmb,xzm1b,xzm,xzm1,b);
    ಕೂಡಿಸು(a0,xzmb,xzmb + 32);
    sub(a0 + 32,xzmb,xzmb + 32);
    ಕೂಡಿಸು(a1,xzm1b,xzm1b + 32);
    sub(a1 + 32,xzm1b,xzm1b + 32);
    ವರ್ಗಫಲ(b0,a0);
    ವರ್ಗಫಲ(b0 + 32,a0 + 32);
    mult(b1,a1,a0 + 32);
    mult(b1 + 32,a1 + 32,a0);
    ಕೂಡಿಸು(c1,b1,b1 + 32);
    sub(c1 + 32,b1,b1 + 32);
    ವರ್ಗಫಲ(r,c1 + 32);
    sub(s,b0,b0 + 32);
    mult121665(t,s);
    ಕೂಡಿಸು(u,t,b0);
    mult(xznb,b0,b0 + 32);
    mult(xznb + 32,s,u);
    ವರ್ಗಫಲ(xzn1b,c1);
    mult(xzn1b + 32,r,work);
    select(xzm,xzm1,xznb,xzn1b,b);
  }

  ಗಾಗಿ (j = 0;j < 64;++j) work[j] = xzm[j];
}

ಸ್ಥಿರ ಶೂನ್ಯ recip(ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ ಹೊರಹೋಗು[32],ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z[32])
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z9[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z11[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2_5_0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2_10_0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2_20_0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2_50_0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ z2_100_0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ t0[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ t1[32];
  ಪೂರ್ಣಾಂಕ i;

  /* 2 */ ವರ್ಗಫಲ(z2,z);
  /* 4 */ ವರ್ಗಫಲ(t1,z2);
  /* 8 */ ವರ್ಗಫಲ(t0,t1);
  /* 9 */ mult(z9,t0,z);
  /* 11 */ mult(z11,z9,z2);
  /* 22 */ ವರ್ಗಫಲ(t0,z11);
  /* 2^5 - 2^0 = 31 */ mult(z2_5_0,t0,z9);

  /* 2^6 - 2^1 */ ವರ್ಗಫಲ(t0,z2_5_0);
  /* 2^7 - 2^2 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^8 - 2^3 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^9 - 2^4 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^10 - 2^5 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^10 - 2^0 */ mult(z2_10_0,t0,z2_5_0);

  /* 2^11 - 2^1 */ ವರ್ಗಫಲ(t0,z2_10_0);
  /* 2^12 - 2^2 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^20 - 2^10 */ ಗಾಗಿ (i = 2;i < 10;i += 2) { ವರ್ಗಫಲ(t0,t1); ವರ್ಗಫಲ(t1,t0); }
  /* 2^20 - 2^0 */ mult(z2_20_0,t1,z2_10_0);

  /* 2^21 - 2^1 */ ವರ್ಗಫಲ(t0,z2_20_0);
  /* 2^22 - 2^2 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^40 - 2^20 */ ಗಾಗಿ (i = 2;i < 20;i += 2) { ವರ್ಗಫಲ(t0,t1); ವರ್ಗಫಲ(t1,t0); }
  /* 2^40 - 2^0 */ mult(t0,t1,z2_20_0);

  /* 2^41 - 2^1 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^42 - 2^2 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^50 - 2^10 */ ಗಾಗಿ (i = 2;i < 10;i += 2) { ವರ್ಗಫಲ(t1,t0); ವರ್ಗಫಲ(t0,t1); }
  /* 2^50 - 2^0 */ mult(z2_50_0,t0,z2_10_0);

  /* 2^51 - 2^1 */ ವರ್ಗಫಲ(t0,z2_50_0);
  /* 2^52 - 2^2 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^100 - 2^50 */ ಗಾಗಿ (i = 2;i < 50;i += 2) { ವರ್ಗಫಲ(t0,t1); ವರ್ಗಫಲ(t1,t0); }
  /* 2^100 - 2^0 */ mult(z2_100_0,t1,z2_50_0);

  /* 2^101 - 2^1 */ ವರ್ಗಫಲ(t1,z2_100_0);
  /* 2^102 - 2^2 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^200 - 2^100 */ ಗಾಗಿ (i = 2;i < 100;i += 2) { ವರ್ಗಫಲ(t1,t0); ವರ್ಗಫಲ(t0,t1); }
  /* 2^200 - 2^0 */ mult(t1,t0,z2_100_0);

  /* 2^201 - 2^1 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^202 - 2^2 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^250 - 2^50 */ ಗಾಗಿ (i = 2;i < 50;i += 2) { ವರ್ಗಫಲ(t0,t1); ವರ್ಗಫಲ(t1,t0); }
  /* 2^250 - 2^0 */ mult(t0,t1,z2_50_0);

  /* 2^251 - 2^1 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^252 - 2^2 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^253 - 2^3 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^254 - 2^4 */ ವರ್ಗಫಲ(t0,t1);
  /* 2^255 - 2^5 */ ವರ್ಗಫಲ(t1,t0);
  /* 2^255 - 21 */ mult(ಹೊರಹೋಗು,t1,z11);
}

ಪೂರ್ಣಾಂಕ crypto_scalarmult_curve25519(ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *q,
  ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *n,
  ಸ್ಥಿರಾಂಕ ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ *p)
{
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ work[96];
  ಚಿಹ್ನೆರಹಿತ ಅಕ್ಷರ e[32];
  ಚಿಹ್ನೆರಹಿತ ಪೂರ್ಣಾಂಕ i;
  ಗಾಗಿ (i = 0;i < 32;++i) e[i] = n[i];
  e[0] &= 248;
  e[31] &= 127;
  e[31] |= 64;
  ಗಾಗಿ (i = 0;i < 32;++i) work[i] = p[i];
  mainloop(work,e);
  recip(work + 32,work + 32);
  mult(work + 64,work,work + 32);
  freeze(work + 64);
  ಗಾಗಿ (i = 0;i < 32;++i) q[i] = work[64 + i];
  ಹಿಂತಿರುಗಿ 0;
}
