#अन्तर्भाव <stddef.h>
#अन्तर्भाव <stdio.h>
#अन्तर्भाव <stdint.h>
#अन्तर्भाव <string.h>
#अन्तर्भाव <stdlib.h>

बाह्य "C" {

#अन्तर्भाव "sshsig.h"

पूर्णाङ्क LLVMFuzzer_Test_One_निवेशः(ध्रुव uint8_t* दत्त, आकार_t आकार)
{
	वर्ण *cp = (वर्ण *)स्मृतिं_देहि(आकार + 1);
	संरचना sshsigopt *opts = रिक्त;

	यदि (cp == रिक्त)
		गच्छ बहिर्गमनम्;
	स्मृतिं_प्रतिलिख(cp, दत्त, आकार);
	cp[आकार] = '\0';
	यदि ((opts = sshsigopt_parse(cp, "libfuzzer", 0, रिक्त)) == रिक्त)
		गच्छ बहिर्गमनम्;

 बहिर्गमनम्:
	मुक्त(cp);
	sshsigopt_free(opts);
	प्रत्यागम 0;
}

} // extern "C"
