#అన్తర్భావ <stddef.h>
#అన్తర్భావ <stdio.h>
#అన్తర్భావ <stdint.h>
#అన్తర్భావ <string.h>
#అన్తర్భావ <stdlib.h>

బాహ్య "C" {

#అన్తర్భావ "sshsig.h"

పూర్ణాంకం LLVMFuzzer_Test_One_ఆదానం(స్థిరరాశి uint8_t* దత్తాంశం, కొలత_t కొలత)
{
	అక్షరం *cp = (అక్షరం *)జ్ఞాపకం_ఇవ్వు(కొలత + 1);
	నిర్మాణం sshsigopt *opts = ఖాళీ;

	ఒకవేళ (cp == ఖాళీ)
		వెళ్ళు బహిర్గతం;
	జ్ఞాపకం_నకలు(cp, దత్తాంశం, కొలత);
	cp[కొలత] = '\0';
	ఒకవేళ ((opts = sshsigopt_parse(cp, "libfuzzer", 0, ఖాళీ)) == ఖాళీ)
		వెళ్ళు బహిర్గతం;

 బహిర్గతం:
	విడుదల(cp);
	sshsigopt_free(opts);
	తిరిగి 0;
}

} // extern "C"
